In [1]:
%defaultDatasource jdbc:h2:mem:db

In [2]:
DROP TABLE IF EXISTS Cidade;
DROP TABLE IF EXISTS Pessoa;

In [3]:
-- Pessoa(nome, nome_da_mãe, ano_nascimento, nome_cidade_natal)
--   nome_cidade_natal → CHE Cidade
-- Cidade(nome_cidade, sigla_estado)

CREATE TABLE Cidade (
  Nome_Cidade VARCHAR(100) NOT NULL,
  Sigla_Estado VARCHAR(2) NOT NULL,
  PRIMARY KEY(Nome_Cidade)
);

CREATE TABLE Pessoa (
  Nome VARCHAR(100) NOT NULL,
  Nome_Mae VARCHAR(100),
  Ano_Nascimento INTEGER NOT NULL,
  Nome_Cidade_Natal VARCHAR(100) NOT NULL,
  PRIMARY KEY(Nome),
  FOREIGN KEY(Nome_Mae)
    REFERENCES Pessoa(Nome)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION,
  FOREIGN KEY(Nome_Cidade_Natal)
    REFERENCES Cidade(Nome_Cidade)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

In [4]:
INSERT INTO Cidade VALUES ('Salvador', 'BA');
INSERT INTO Cidade VALUES ('Itabuna', 'BA');
INSERT INTO Cidade VALUES ('Campinas', 'SP');

INSERT INTO Pessoa VALUES ('Melissa', NULL, 1930, 'Salvador');
INSERT INTO Pessoa VALUES ('Asdrubal', 'Melissa', 1970, 'Salvador');
INSERT INTO Pessoa VALUES ('Quincas', 'Melissa', 1973, 'Salvador');
INSERT INTO Pessoa VALUES ('Doriana', NULL, 1970, 'Campinas');
INSERT INTO Pessoa VALUES ('Alcebiades', 'Doriana', 2010, 'Campinas');
INSERT INTO Pessoa VALUES ('Lucinda', 'Melissa', 2015, 'Itabuna');
INSERT INTO Pessoa VALUES ('Horacio', 'Melissa', 2017, 'Itabuna');

In [5]:
SELECT * FROM Cidade;

In [6]:
SELECT * FROM Pessoa;

In [7]:
SELECT DISTINCT Nome_Mae FROM Pessoa WHERE Nome_Mae IS NOT NULL;

In [8]:
SELECT DISTINCT Nome_Mae
       FROM Pessoa
       WHERE Nome_Mae IS NOT NULL AND
             Ano_Nascimento <= 2009;

Melissa

In [9]:
SELECT P.Nome, C.Sigla_Estado
       FROM Pessoa P, Cidade C
       WHERE P.Nome_Cidade_Natal = C.Nome_Cidade AND C.Sigla_Estado = 'SP';

In [10]:
SELECT P.Nome, C.Sigla_Estado
       FROM Pessoa P JOIN Cidade C
            ON P.Nome_Cidade_Natal = C.Nome_Cidade
       WHERE C.Sigla_Estado = 'SP';

In [11]:
SELECT C.Sigla_Estado, COUNT(*) Quantidade_Pessoas
       FROM Pessoa P, Cidade C
       WHERE P.Nome_Cidade_Natal = C.Nome_Cidade
       GROUP BY C.Sigla_Estado;

# ALIAS

## Mesma Tabela com dois ALIAS

A mesma tabela pode aparecer em dois pontos a consulta com nomes diferentes como se fossem duas tabelas, cada uma com um ALIAS.

Tabela de Pessoas:

In [12]:
SELECT * FROM Pessoa;

Nomes das pessoas que nasceram na mesma cidade de Asdrúbal:

In [13]:
SELECT P2.Nome
FROM Pessoa P1, Pessoa P2
WHERE P1.Nome = 'Asdrubal' AND
      P2.Nome_Cidade_Natal = P1.Nome_Cidade_Natal AND
      P2.Nome <> 'Asdrubal'

In [14]:
SELECT * FROM Cidade;

Nomes das pessoas que nasceram no mesmo estado de Asdrúbal:

In [15]:
SELECT P2.Nome 
FROM Pessoa P1, Cidade C1, Pessoa P2, Cidade C2 
WHERE P1.Nome = 'Asdrubal' AND
      P1.Nome_Cidade_Natal = C1.Nome_Cidade AND
      P2.Nome <> 'Asdrubal' AND
      P2.Nome_Cidade_Natal = C2.Nome_Cidade AND
      C1.Sigla_Estado = C2.Sigla_Estado